app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."pseudo" = $1 LIMIT 1  [["pseudo", "petgen3768"]]
---
    def set_user
      @user = User.find_by_pseudo(params[:pseudo])